/* errAuthorizationInvalidSet */
"-60001" = "Les droits d’autorisation ne sont pas valides.";

/* errAuthorizationInvalidRef */
"-60002" = "La référence d’autorisation n’est pas valide.";

/* errAuthorizationInvalidTag */
"-60003" = "La balise d’autorisation n’est pas valide.";

/* errAuthorizationInvalidPointer */
"-60004" = "L’autorisation renvoyée n’est pas valide.";

/* errAuthorizationDenied */
"-60005" = "L’autorisation a été refusée.";

/* errAuthorizationCanceled */
"-60006" = "L’autorisation a été annulée par l’utilisateur.";

/* errAuthorizationInteractionNotAllowed */
"-60007" = "L’autorisation a été refusée car aucune interaction avec l’utilisateur n’était possible.";

/* errAuthorizationInternal */
"-60008" = "Il est impossible d’obtenir l’autorisation pour cette opération.";

/* errAuthorizationExternalizeNotAllowed */
"-60009" = "Il est interdit de convertir l’autorisation en un format externe.";

/* errAuthorizationInternalizeNotAllowed */
"-60010" = "Il est interdit de créer l’autorisation à partir d’un format externe.";

/* errAuthorizationInvalidFlags */
"-60011" = "Le ou les indicateurs d’options ne sont pas valides pour cette opération d’autorisation.";

/* errAuthorizationToolExecuteFailure */
"-60031" = "Le programme spécifié n’a pu être exécuté.";

/* errAuthorizationToolEnvironmentError */
"-60032" = "Un état non valide a été renvoyé pendant l’exécution d’un outil privilégié.";

/* errAuthorizationBadAddress */
"-60033" = "L’adresse de socket requise n’est pas valide (elle doit être entre 0 et 1 023).";

/* errSSLProtocol */
"-9800" = "Erreur de protocole SSL";

/* errSSLNegotiation */
"-9801" = "Echec lors de la négociation Cipher Suite";

/* errSSLFatalAlert */
"-9802" = "Alerte fatale";

/* errSSLWouldBlock */
"-9803" = "E/S bloquerait (non fatal)";

/* errSSLSessionNotFound */
"-9804" = "Tentative de restauration d’une session inconnue";

/* errSSLClosedGraceful */
"-9805" = "La connexion s’est fermée correctement";

/* errSSLClosedAbort */
"-9806" = "La connexion a été fermée avec erreur";

/* errSSLXCertChainInvalid */
"-9807" = "chaîne de certification non valide";

/* errSSLBadCert */
"-9808" = "Mauvais format de certificat";

/* errSSLCrypto */
"-9809" = "Erreur de chiffrement sous-jacente";

/* errSSLInternal */
"-9810" = "Erreur interne";

/* errSSLModuleAttach */
"-9811" = "Echec lors de la connexion au module";

/* errSSLUnknownRootCert */
"-9812" = "Chaîne de certification valide, racine non approuvée";

/* errSSLNoRootCert */
"-9813" = "la chaîne de certification n’a pas été vérifiée par la racine";

/* errSSLCertExpired */
"-9814" = "La chaîne avait une certification expirée";

/* errSSLCertNotYetValid */
"-9815" = "La chaîne avait une certification qui n’est pas encore valide";

/* errSSLClosedNoNotify */
"-9816" = "Le serveur a fermé la session sans aucune notification";

/* errSSLBufferOverflow */
"-9817" = "La mémoire tampon disponible est insuffisante";

/* errSSLBadCipherSuite */
"-9818" = "mauvais SSLCipherSuite";

/* errSSLPeerUnexpectedMsg */
"-9819" = "Message reçu inattendu";

/* errSSLPeerBadRecordMac */
"-9820" = "mauvais MAC";

/* errSSLPeerDecryptionFail */
"-9821" = "Echec du déchiffrement";

/* errSSLPeerRecordOverflow */
"-9822" = "Enregistrer le débordement";

/* errSSLPeerDecompressFail */
"-9823" = "Echec lors de la décompression";

/* errSSLPeerHandshakeFail */
"-9824" = "Echec lors du contrôle";

/* errSSLPeerBadCert */
"-9825" = "Divers mauvais certificats";

/* errSSLPeerUnsupportedCert */
"-9826" = "Format de certificat non supporté";

/* errSSLPeerCertRevoked */
"-9827" = "certificat annulé";

/* errSSLPeerCertExpired */
"-9828" = "certificat expiré";

/* errSSLPeerCertUnknown */
"-9829" = "Certificat inconnu";

/* errSSLIllegalParam */
"-9830" = "Paramètre incorrect";

/* errSSLPeerUnknownCA */
"-9831" = "Autorité de certificat inconnue";

/* errSSLPeerAccessDenied */
"-9832" = "Accès refusé.";

/* errSSLPeerDecodeError */
"-9833" = "erreur de décodage";

/* errSSLPeerDecryptError */
"-9834" = "erreur de déchiffrement";

/* errSSLPeerExportRestriction */
"-9835" = "Restriction de l’exportation";

/* errSSLPeerProtocolVersion */
"-9836" = "Mauvaise version de protocole";

/* errSSLPeerInsufficientSecurity */
"-9837" = "Sécurité insuffisante";

/* errSSLPeerInternalError */
"-9838" = "erreur interne";

/* errSSLPeerUserCancelled */
"-9839" = "Annulé par l’utilisateur";

/* errSSLPeerNoRenegotiation */
"-9840" = "Aucune renégociation n’est autorisée";

/* errSSLServerAuthCompleted */
"-9841" = "le certificat de serveur n’est pas valide ou, si la vérification est désactivée, a été ignoré";

/* errSSLClientCertRequested */
"-9842" = "le serveur a requis un certificat de client";

/* errSSLHostNameMismatch */
"-9843" = "discordance de nom d’hôte homologue";

/* errSSLConnectionRefused */
"-9844" = "l’homologue a rompue la connexion avant de répondre";

/* errSSLDecryptionFail */
"-9845" = "Echec de déchiffrement";

/* errSSLBadRecordMac */
"-9846" = "mauvais MAC";

/* errSSLRecordOverflow */
"-9847" = "Enregistrer le débordement";

/* errSSLBadConfiguration */
"-9848" = "Erreur de configuration";

/* errSecSuccess */
"0" = "Aucune erreur.";

/* errSecUnimplemented */
"-4" = "Fonction ou opération non implémentéé.";

/* errSecParam */
"-50" = "Un ou plusieurs paramètres passés à la fonction ne sont pas valides.";

/* errSecAllocate */
"-108" = "Échec d’allocation de mémoire.";

/* errSecNotAvailable */
"-25291" = "Aucun trousseau n’est disponible. Vous devrez peut-être redémarrer votre ordinateur.";

/* errSecReadOnly */
"-25292" = "Ce trousseau ne peut-être modifie.";

/* errSecAuthFailed */
"-25293" = "Le nom d’utilisateur ou le mot de passe principal que vous avez saisi est invalide.";

/* errSecNoSuchKeychain */
"-25294" = "Le trousseau spécifié est introuvable.";

/* errSecInvalidKeychain */
"-25295" = "Le trousseau spécifié n’est pas un fichier trousseau valide.";

/* errSecDuplicateKeychain */
"-25296" = "Un trousseau existe déjà sous le même nom.";

/* errSecDuplicateCallback */
"-25297" = "La fonction de rappel spécifiée est déjà installée.";

/* errSecInvalidCallback */
"-25298" = "La fonction de rappel spécifiée est invalide.";

/* errSecDuplicateItem */
"-25299" = "L’élément spécifié existe déjà dans le trousseau.";

/* errSecItemNotFound */
"-25300" = "L’élément spécifié est introuvable dans le trousseau.";

/* errSecBufferTooSmall */
"-25301" = "Mémoire insuffisante pour l’utilisation de cet élément.";

/* errSecDataTooLarge */
"-25302" = "Cet élément contient des informations qui sont trop volumineuses ou dans un format non reconnu.";

/* errSecNoSuchAttr */
"-25303" = "L’attribut spécifié n’existe pas.";

/* errSecInvalidItemRef */
"-25304" = "L’élément spécifié n’est plus valide. Il a peut-être été efface du trousseau.";

/* errSecInvalidSearchRef */
"-25305" = "Impossible de rechercher le trousseau actuel.";

/* errSecNoSuchClass */
"-25306" = "L’élément spécifié ne semble pas appartenir a un trousseau valide.";

/* errSecNoDefaultKeychain */
"-25307" = "Un trousseau par défaut est introuvable.";

/* errSecInteractionNotAllowed */
"-25308" = "L’interaction avec l’utilisateur est interdite.";

/* errSecReadOnlyAttr */
"-25309" = "L’attribut spécifié n’a pu être modifié.";

/* errSecWrongSecVersion */
"-25310" = "Ce trousseau a été crée sous une version différente du logiciel système et ne peut être ouvert.";

/* errSecKeySizeNotAllowed */
"-25311" = "Cet élément spécifie une clé trop volumineuse.";

/* errSecNoStorageModule */
"-25312" = "Une composante requise (module de stockage de donnée) n’a pu être chargée. Vous devez peut être redémarrer votre ordinateur.";

/* errSecNoCertificateModule */
"-25313" = "Une composante requise (module de certification) n’a pu être chargée. Vous devez peut être redémarrer votre ordinateur.";

/* errSecNoPolicyModule */
"-25314" = "Une composante requise (module de réglementation) n’a pu être chargée. Vous devez peut être redémarrer votre ordinateur.";

/* errSecInteractionRequired */
"-25315" = "L’interaction avec l’utilisateur est requise mais interdite pour le moment.";

/* errSecDataNotAvailable */
"-25316" = "Le contenu de cet élément ne peut être révélé.";

/* errSecDataNotModifiable */
"-25317" = "Le contenu de cet élément ne peut être modifié.";

/* errSecCreateChainFailed */
"-25318" = "Un ou plusieurs certificats requis pour valider ce certificat sont introuvables.";

/* errSecInvalidPrefsDomain */
"-25319" = "Le domaine de préférences spécifié est invalide.";

/* errSecACLNotSimple */
"-25240" = "La liste de contrôle d’accès n’est pas au format standard (simple).";

/* errSecPolicyNotFound */
"-25241" = "Impossible de localiser la règle spécifiée.";

/* errSecInvalidTrustSetting */
"-25242" = "Les réglages de confiance spécifiés sont incorrects.";

/* errSecNoAccessForItem */
"-25243" = "L’élément spécifié n’a pas de contrôle d’accès.";

/* errSecInvalidOwnerEdit */
"-25244" = "La tentative de changement de propriétaire pour cet élément a échouée.";

/* errSecTrustNotAvailable */
"-25245" = "Aucun résultat de confiance n’est disponible.";

/* errSecUnsupportedFormat */
"-25256" = "Format Importer/Exporter ingérable.";

/* errSecUnknownFormat */
"-25257" = "Format inconnu dans l’importation.";

/* errSecKeyIsSensitive */
"-25258" = "La clé doit être enveloppée pour l’exportation.";

/* errSecMultiplePrivKeys */
"-25259" = "Tentative d’importation de plusieurs clés privées.";

/* errSecPassphraseRequired */
"-25260" = "Le mot de passe principal est requis pour importer/exporter.";

/* errSecInvalidPasswordRef */
"-25261" = "La référence du mot de passe n’était pas valide.";

/* errSecInvalidTrustSettings */
"-25262" = "L’enregistrement de réglages de confiance était corrompu.";

/* errSecNoTrustSettings */
"-25263" = "Réglages de confiance introuvables.";

/* errSecPkcs12VerifyFailure */
"-25264" = "La vérification MAC a échoué durant l’importation de PKCS12.";

/* errSecDecode */
"-26275" = "Impossible de décoder le certificat fourni.";

/* CSSMERR_CSP_INVALID_DATA_COUNT */
"-2147415768" = "Valeurs d’erreur des vecteurs de mémoire tampon CSP.";

/* CSSMERR_CSP_INVALID_CONTEXT */
"-2147415760" = "Valeur d’erreur du contexte cryptographique CSP.";

/* CSSMERR_CSP_STAGED_OPERATION_IN_PROGRESS */
"-2147415736" = "Valeurs d’erreur de l’API cryptographique CSP à niveaux.";

/* CSSMERR_CSP_APPLE_PUBLIC_KEY_INCOMPLETE */
"-2147415039" = "* Détection d’une tentative d’utilisation de clé publique incomplète en raison * de l’absence de paramètres spécifiques à l’algorithme.";

/* CSSMERR_CSP_APPLE_SIGNATURE_MISMATCH */
"-2147415038" = "une correspondance de signature de code a échoué";

/* CSSMERR_CSP_APPLE_INVALID_KEY_START_DATE */
"-2147415037" = "StartDate/EndDate de la clé non valide";

/* CSSMERR_CSPDL_APPLE_DL_CONVERSION_ERROR */
"-2147415035" = "Codes d’erreur de synchronisation du trousseau";

/* CSSMERR_CSP_APPLE_SSLv2_ROLLBACK */
"-2147415034" = "Vérification du remplissage SSLv2 : attaque de défilement arrière détectée";

/* CSSMERR_APPLEDL_INVALID_OPEN_PARAMETERS */
"-2147412992" = "L’argument OpenParameters passé à CSSM_DL_DbCreate ou CSSM_DL_DbOpen n’était ni NULL, ni un pointeur vers une structure CSSM_APPLEDL_OPEN_PARAMETERS valide.";

/* CSSMERR_APPLEDL_DISK_FULL */
"-2147412991" = "une opération a échoué parce que le disque était plein";

/* CSSMERR_APPLEDL_QUOTA_EXCEEDED */
"-2147412990" = "Une opération a échoué : quota du disque dépassé.";

/* CSSMERR_APPLEDL_FILE_TOO_BIG */
"-2147412989" = "une opération a échoué parce que la taille d’un fichier était trop grande";

/* CSSMERR_APPLEDL_INVALID_DATABASE_BLOB */
"-2147412988" = "les informations internes d’une base de données de trousseau (« blob ») n’est pas valide";

/* CSSMERR_APPLEDL_INCOMPATIBLE_DATABASE_BLOB */
"-2147412986" = "la version du format de données interne pour les informations internes d’une base de données (« blob ») n’est pas valide";

/* CSSMERR_APPLETP_HOSTNAME_MISMATCH */
"-2147408896" = "Les noms d’hôte ne correspondent pas";

/* CSSMERR_APPLETP_UNKNOWN_CRITICAL_EXTEN */
"-2147408895" = "Extension non comprise avec l’indicateur Critique vrai";

/* CSSMERR_APPLETP_NO_BASIC_CONSTRAINTS */
"-2147408894" = "Extension de contraintes de base requise par les règles, mais absente";

/* CSSMERR_APPLETP_INVALID_CA */
"-2147408893" = "BasicConstraints.CA non valide";

/* CSSMERR_APPLETP_INVALID_AUTHORITY_ID */
"-2147408892" = "L’ID de clé de l’autorité n’est pas valide ";

/* CSSMERR_APPLETP_INVALID_SUBJECT_ID */
"-2147408891" = "ID de clé d’objet non valide ";

/* CSSMERR_APPLETP_INVALID_KEY_USAGE */
"-2147408890" = "Utilisation de clé incorrecte pour les règles";

/* CSSMERR_APPLETP_INVALID_EXTENDED_KEY_USAGE */
"-2147408889" = "Utilisation de clé étendue incorrecte pour les règles";

/* CSSMERR_APPLETP_INVALID_ID_LINKAGE */
"-2147408888" = "Lien d’ID de clé d’objet/d’autorité non valide.";

/* CSSMERR_APPLETP_PATH_LEN_CONSTRAINT */
"-2147408887" = "Dépassement de PathLengthConstraint";

/* CSSMERR_APPLETP_INVALID_ROOT */
"-2147408886" = "Le groupe de certificats terminait à un certificat racine qui ne pouvait pas se vérifier lui-même";

/* CSSMERR_APPLETP_CRL_EXPIRED */
"-2147408885" = "CRL périmée ou pas encore valide";

/* CSSMERR_APPLETP_CRL_NOT_FOUND */
"-2147408883" = "Impossible de trouver une CRL appropriée";

/* CSSMERR_APPLETP_CRL_SERVER_DOWN */
"-2147408882" = "Le serveur CRL indiqué est indisponible";

/* CSSMERR_APPLETP_CRL_BAD_URI */
"-2147408881" = "URL de point de distribution CRL non qualifiée";

/* CSSMERR_APPLETP_UNKNOWN_CERT_EXTEN */
"-2147408880" = "Extension de certificat/CRL critique inconnue";

/* CSSMERR_APPLETP_CRL_NOT_TRUSTED */
"-2147408878" = "Impossible de vérifier la CRL pour le point d’ancrage ou la racine";

/* CSSMERR_APPLETP_CRL_INVALID_ANCHOR_CERT */
"-2147408877" = "CRL vérifiée pour une racine non approuvée";

/* CSSMERR_APPLETP_CRL_POLICY_FAIL */
"-2147408876" = "La vérification des règles de la CRL a échoué";

/* CSSMERR_APPLETP_IDP_FAIL */
"-2147408875" = "Violation de l’extension IssuingDistributionPoint";

/* CSSMERR_APPLETP_CERT_NOT_FOUND_FROM_ISSUER */
"-2147408874" = "Certificat introuvable auprès du issuerAltName indiqué";

/* CSSMERR_APPLETP_BAD_CERT_FROM_ISSUER */
"-2147408873" = "Le certificat obtenu du issuerAltName indiqué est incorrect";

/* CSSMERR_APPLETP_SMIME_EMAIL_ADDRS_NOT_FOUND */
"-2147408872" = "Les adresses électroniques S/MIME ne correspondent pas";

/* CSSMERR_APPLETP_SMIME_BAD_EXT_KEY_USE */
"-2147408871" = "ExtendedKeyUsage S/MIME approprié introuvable ";

/* CSSMERR_APPLETP_SMIME_BAD_KEY_USE */
"-2147408870" = "Incompatibilité de KeyUsage S/MIME";

/* CSSMERR_APPLETP_SMIME_KEYUSAGE_NOT_CRITICAL */
"-2147408869" = "S/MIME, certificat avec KeyUsage indiqué comme !critical";

/* CSSMERR_APPLETP_SMIME_NO_EMAIL_ADDRS */
"-2147408868" = "S/MIME, feuille avec nom d’objet vide et aucune adresse électronique * dans SubjectAltName";

/* CSSMERR_APPLETP_SMIME_SUBJ_ALT_NAME_NOT_CRIT */
"-2147408867" = "S/MIME, feuille avec nom d’objet vide, SubjectAltName * non critique";

/* CSSMERR_APPLETP_SSL_BAD_EXT_KEY_USE */
"-2147408866" = "ExtendedKeyUsage SSL approprié introuvable";

/* CSSMERR_APPLETP_OCSP_BAD_RESPONSE */
"-2147408865" = "réponse OCSP impossible à analyser";

/* CSSMERR_APPLETP_OCSP_BAD_REQUEST */
"-2147408864" = "requête OCSP impossible à analyser";

/* CSSMERR_APPLETP_OCSP_UNAVAILABLE */
"-2147408863" = "Service OCSP indisponible";

/* CSSMERR_APPLETP_OCSP_STATUS_UNRECOGNIZED */
"-2147408862" = "Statut OCSP : certificat non reconnu";

/* CSSMERR_APPLETP_INCOMPLETE_REVOCATION_CHECK */
"-2147408861" = "échec de la vérification de révocation pour chaque certificat";

/* CSSMERR_APPLETP_NETWORK_FAILURE */
"-2147408860" = "erreur générale de réseau";

/* CSSMERR_APPLETP_OCSP_NOT_TRUSTED */
"-2147408859" = "La réponse OCSP ne correspond pas à un point d’ancrage ou à la racine";

/* CSSMERR_APPLETP_OCSP_INVALID_ANCHOR_CERT */
"-2147408858" = "La réponse OCSP correspondait à une racine non approuvée";

/* CSSMERR_APPLETP_OCSP_SIG_ERROR */
"-2147408857" = "Erreur de signature dans la réponse OCSP";

/* CSSMERR_APPLETP_OCSP_NO_SIGNER */
"-2147408856" = "Aucun signataire trouvé pour la réponse OCSP";

/* CSSMERR_APPLETP_OCSP_RESP_MALFORMED_REQ */
"-2147408855" = "Statut du répondeur OCSP : requête mal formée";

/* CSSMERR_APPLETP_OCSP_RESP_INTERNAL_ERR */
"-2147408854" = "Statut du répondeur OCSP : erreur interne";

/* CSSMERR_APPLETP_OCSP_RESP_TRY_LATER */
"-2147408853" = "Statut du répondeur OCSP : réessayez ultérieurement";

/* CSSMERR_APPLETP_OCSP_RESP_SIG_REQUIRED */
"-2147408852" = "Statut du répondeur OCSP : signature requise";

/* CSSMERR_APPLETP_OCSP_RESP_UNAUTHORIZED */
"-2147408851" = "Statut du répondeur OCSP : non autorisé";

/* CSSMERR_APPLETP_OCSP_NONCE_MISMATCH */
"-2147408850" = "L’identificateur temporaire de la réponse OCSP ne correspondait pas à la requête";

/* CSSMERR_APPLETP_CS_BAD_CERT_CHAIN_LENGTH */
"-2147408849" = "Longueur de chaîne de certificat illégale pour la signature de code";

/* CSSMERR_APPLETP_CS_NO_BASIC_CONSTRAINTS */
"-2147408848" = "Contraintes élémentaires manquantes pour la signature de code";

/* CSSMERR_APPLETP_CS_BAD_PATH_LENGTH */
"-2147408847" = "PathLengthConstraint incorrect pour la signature de code";

/* CSSMERR_APPLETP_CS_NO_EXTENDED_KEY_USAGE */
"-2147408846" = "ExtendedKeyUsage manquant pour la signature de code";

/* CSSMERR_APPLETP_CODE_SIGN_DEVELOPMENT */
"-2147408845" = "Certification de signature de code de type développement détectée";

/* CSSMERR_APPLETP_RS_BAD_CERT_CHAIN_LENGTH */
"-2147408844" = "Longueur de chaîne de certificat invalide pour la signature de ressources";

/* CSSMERR_APPLETP_RS_BAD_EXTENDED_KEY_USAGE */
"-2147408843" = "utilisation de clé étendue incorrecte pour la signature de ressources";

/* CSSMERR_APPLETP_TRUST_SETTING_DENY */
"-2147408842" = "Réglage d’approbation : refuser";

/* CSSMERR_APPLETP_INVALID_EMPTY_SUBJECT */
"-2147408841" = "SubjectName vide non valide";

/* CSSMERR_APPLETP_UNKNOWN_QUAL_CERT_STATEMENT */
"-2147408840" = "ID de déclaration de certificat qualifié critique inconnu";

/* CSSMERR_APPLE_DOTMAC_REQ_QUEUED */
"-2147408796" = "demande de certificat mise en attente";

/* CSSMERR_APPLE_DOTMAC_REQ_REDIRECT */
"-2147408795" = "demande de certificat redirigée";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_ERR */
"-2147408794" = "erreur générale signalée par le serveur";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_PARAM */
"-2147408793" = "erreur de paramètre signalée par le serveur";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_AUTH */
"-2147408792" = "erreur d’autorisation signalée par le serveur";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_UNIMPL */
"-2147408791" = "erreur signalée par le serveur non implémentée";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_NOT_AVAIL */
"-2147408790" = "erreur signalée par le serveur non disponible";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_ALREADY_EXIST */
"-2147408789" = "erreur signalée par le serveur existe déjà";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_SERVICE_ERROR */
"-2147408788" = "erreur de service signalée par le serveur";

/* CSSMERR_APPLE_DOTMAC_REQ_IS_PENDING */
"-2147408787" = "requête déjà en attente pour l’utilisateur indiqué";

/* CSSMERR_APPLE_DOTMAC_NO_REQ_PENDING */
"-2147408786" = "aucune requête en attente pour l’utilisateur indiqué";

/* CSSMERR_APPLE_DOTMAC_CSR_VERIFY_FAIL */
"-2147408785" = "échec de la vérification de la CSR";

/* CSSMERR_APPLE_DOTMAC_FAILED_CONSISTENCY_CHECK */
"-2147408784" = "échec du test de cohérence d’après le serveur";

/* errSecCSUnimplemented */
"-67072" = "fonctionnalité de signature de code non implémentée";

/* errSecCSInvalidObjectRef */
"-67071" = "référence d’objet API non valide";

/* errSecCSInvalidFlags */
"-67070" = "indicateurs précisés non valides ou non conformes";

/* errSecCSObjectRequired */
"-67069" = "un argument pointeur requis était NULL";

/* errSecCSStaticCodeNotFound */
"-67068" = "objet code introuvable sur le disque";

/* errSecCSUnsupportedGuestAttributes */
"-67067" = "impossible de détecter des invités utilisant ce jeu d’attributs";

/* errSecCSInvalidAttributeValues */
"-67066" = "les valeurs données pour cet attribut ne sont pas valides";

/* errSecCSNoSuchCode */
"-67065" = "hôte sans invité doté de ces attributs";

/* errSecCSMultipleGuests */
"-67064" = "l’hôte a plusieurs invités dotés de cette valeur d’attribut";

/* errSecCSGuestInvalid */
"-67063" = "l’identité du code a été invalidée";

/* errSecCSUnsigned */
"-67062" = "objet code non signé";

/* errSecCSSignatureFailed */
"-67061" = "code ou signature modifié";

/* errSecCSSignatureNotVerifiable */
"-67060" = "impossible de lire la signature, peut-être en raison d’un système de fichiers appliquant la racine à un utilisateur non privilégié";

/* errSecCSSignatureUnsupported */
"-67059" = "type ou version de la signature non pris en charge";

/* errSecCSBadDictionaryFormat */
"-67058" = "une ressource ou un fichier plist requis est mal formé";

/* errSecCSResourcesNotSealed */
"-67057" = "les ressources ne sont pas scellées par la signature";

/* errSecCSResourcesNotFound */
"-67056" = "ressources scellées introuvables dans le code";

/* errSecCSResourcesInvalid */
"-67055" = "répertoire de ressources hermétiques non valide";

/* errSecCSBadResource */
"-67054" = "ressource scellée manquante ou non valide";

/* errSecCSResourceRulesInvalid */
"-67053" = "règle(s) de sélection des ressources non valide(s)";

/* errSecCSReqInvalid */
"-67052" = "exigences du code non valides ou corrompues";

/* errSecCSReqUnsupported */
"-67051" = "type ou version des exigences du code non pris en charge";

/* errSecCSReqFailed */
"-67050" = "non satisfaction des exigences du code";

/* errSecCSBadObjectFormat */
"-67049" = "format du fichier objet non valide ou inapproprié";

/* errSecCSInternalError */
"-67048" = "erreur interne dans le sous-système Signature de code";

/* errSecCSHostReject */
"-67047" = "le code a rejeté son hôte";

/* errSecCSNotAHost */
"-67046" = "ce code ne correspond pas à un hôte";

/* errSecCSSignatureInvalid */
"-67045" = "format de la signature non valide";

/* errSecCSHostProtocolRelativePath */
"-67044" = "violation du protocole de l’hôte - le chemin absolu de l’invité est requis";

/* errSecCSHostProtocolContradiction */
"-67043" = "violation du protocole de l’hôte - modes d’hébergement contradictoires";

/* errSecCSHostProtocolDedicationError */
"-67042" = "violation du protocole de l’hôte - opération interdite avec ou pour un invité dédié";

/* errSecCSHostProtocolNotProxy */
"-67041" = "violation du protocole de l’hôte - hébergement proxy non activé";

/* errSecCSHostProtocolStateError */
"-67040" = "violation du protocole de l’hôte - la requête de changement d’état de l’invité est invalide";

/* errSecCSHostProtocolUnrelated */
"-67039" = "violation du protocole de l’hôte - l’invité indiqué n’est pas autorisé sur cet hôte";

/* errSecCSInvalidOperation */
"-67038" = "opération requise invalide";

/* errSecCSNotSupported */
"-67037" = "opération non prise en charge pour ce type de code";

/* errSecCSCMSTooLarge */
"-67036" = "Signature trop longue pour être intégrée";

/* errSecCSHostProtocolInvalidHash */
"-67035" = "violation du protocole de l’hôte - la liste de données de l’invité est invalide";

/* errSecCSStaticCodeChanged */
"-67034" = "le programme sur disque ne correspond pas à ce qui est en cours d’exécution";

/* errSecCSSigDBDenied */
"-67033" = "accès à la bibliothèque de signatures refusé";

/* errSecCSSigDBAccess */
"-67032" = "impossible d’accéder à la bibliothèque de signatures";

/* errSecCSHostProtocolInvalidAttribute */
"-67031" = "l’hôte a renvoyé des attributs d’invités non valides ou incohérents";

/* errSecMisc_dskFulErr */
"-34" = "Le disque est saturé.";

/* errSecMisc_nsvErr */
"-35" = "Le disque est introuvable. Il a dû être éjecté.";

/* errSecMisc_bdNamErr */
"-37" = "Tentative d’ouverture d’un fichier dont le nom contient un caractère irrégulier.";

/* errSecMisc_fnfErr */
"-43" = "Le fichier est introuvable.";

/* errSecMisc_wPrErr */
"-44" = "Le disque est protégé en écriture.";

/* errSecMisc_fLckdErr */
"-45" = "Le fichier est verrouillé.";

/* errSecMisc_vLckdErr */
"-46" = "le volume est verrouillé";

/* errSecMisc_fBsyErr */
"-47" = "Le fichier est en cours d’utilisation. Il doit être utilise par une autre application.";

/* errSecMisc_dupFNErr */
"-48" = "Un fichier existe déjà sous le même nom.";

/* errSecMisc_opWrErr */
"-49" = "Ce fichier est déjà ouvert en écriture";

/* errSecMisc_volOffLinErr */
"-53" = "Le volume n’est plus disponible. Il a dû être éjecté.";

/* errSecMisc_permErr */
"-54" = "Le fichier n’a pu être ouvert. Il doit être utilise par une autre application.";

/* errSecMisc_extFSErr */
"-58" = "Ce volume ne semble pas être compatible.";

/* errSecMisc_wrPermErr */
"-61" = "Impossible d’écrire sur le fichier. Il a dû être ouvert avec des permissions insuffisantes.";

/* errSecMisc_offLinErr */
"-65" = "Le périphérique de stockage n’est plus disponible. Il a dû être éjecté.";

/* errSecMisc_dirNFErr */
"-120" = "Le répertoire est introuvable.";

/* errSecMisc_volGoneErr */
"-124" = "Le volume serveur n’est plus disponible. Il a dû être déconnecté.";

/* errSecMisc_userCanceledErr */
"-128" = "L’opération a été annulée par l’utilisateur.";

/* errSecMisc_resNotFound */
"-192" = "Une ressource requise est introuvable.";

/* errSecMisc_resFNotFound */
"-193" = "Une ressource requise est manquante ou endommagée.";

/* errSecMisc_icNoURLErr */
"-673" = "L’emplacement spécifié (URL) est de type inconnu, ou ne contient pas assez d’information.";

/* errSecMisc_icConfigNotFoundErr */
"-674" = "Une application nécessaire à l’ouverture de l’URL spécifié n’a pu être trouvée";

/* errSecMisc_cantGetFlavorErr */
"-1854" = "L’emplacement (URL) de cet élément est manquant ou mal formaté.";

/* errSecMisc_afpAccessDenied */
"-5000" = "L’accès à cet élément est interdit.";

/* errSecMisc_afpUserNotAuth */
"-5023" = "Échec d’authentification. Le mot de passe de ce serveur a peut-être changé depuis l’ajout de l’élément au trousseau.";

